12/data/attachments/b6ff59aac88476a4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bc07b27b-98ea-4754-abc5-99e04a57ce90</nif:username>
            <nif:friendToBeAdded>Lindsey_style_Friend_89519_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>